; domain
(define (domain BLOCKS)

(:requirements :negative-preconditions
  	:typing
)

(:types block)

(:predicates (on ?x - block ?y - block) (ontable ?x - block) (clear ?x - block) (handempty) (holding ?x - block))

(:action pick-up
  :parameters (?x - block)
  :precondition (and (clear ?x) (ontable ?x) (handempty))
  :effect (and (not (ontable ?x)) (not (clear ?x)) (not (handempty)) (holding ?x)))

(:action put-down
  :parameters (?x - block)
  :precondition (holding ?x)
  :effect (and (not (holding ?x)) (clear ?x) (handempty) (ontable ?x)))

(:action stack
  :parameters (?x - block ?y - block)
  :precondition (and (holding ?x) (clear ?y))
  :effect (and (not (holding ?x)) (not (clear ?y)) (clear ?x) (handempty) (on ?x ?y)))

(:action unstack
  :parameters (?x - block ?y - block)
  :precondition (and (on ?x ?y) (clear ?x) (handempty))
  :effect (and (holding ?x) (clear ?y) (not (clear ?x)) (not (handempty)) (not (on ?x ?y))))

)

; problem
(define (problem p6)
(:domain blocks)
(:objects
 b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 - block
)
(:init
(handempty)
(ontable b21)
(clear b21)
(ontable b14)
(clear b6)
(on b11 b14)
(on b4 b11)
(on b1 b4)
(on b3 b1)
(on b8 b3)
(on b13 b8)
(on b6 b13)
(ontable b23)
(clear b15)
(on b2 b23)
(on b20 b2)
(on b15 b20)
(ontable b17)
(clear b22)
(on b10 b17)
(on b18 b10)
(on b12 b18)
(on b7 b12)
(on b16 b7)
(on b5 b16)
(on b9 b5)
(on b25 b9)
(on b19 b25)
(on b24 b19)
(on b22 b24)
)
(:goal (and
(on b15 b21)
(on b23 b15)
(on b13 b23)
(on b17 b13)
(on b20 b17)
(on b4 b20)
(on b5 b4)
(on b18 b5)
(on b12 b18)
(on b11 b12)
(on b10 b11)
(on b7 b10)
(on b3 b7)
(on b19 b3)
(on b2 b19)
(on b16 b2)
(on b8 b16)
(on b25 b8)
(on b6 b25)
(on b14 b6)
(on b1 b14)
(on b24 b1)
(on b9 b24)
(on b22 b9)
))
)

; plan
1. (unstack b6 b13)
   deleted: (clear b6) (handempty) (on b6 b13)
   added: (holding b6) (clear b13)
   goals met: 1 of 24
2. (put-down b6)
   deleted: (holding b6)
   added: (clear b6) (handempty) (ontable b6)
   goals met: 1 of 24
3. (unstack b13 b8)
   deleted: (clear b13) (handempty) (on b13 b8)
   added: (holding b13) (clear b8)
   goals met: 1 of 24
4. (put-down b13)
   deleted: (holding b13)
   added: (clear b13) (handempty) (ontable b13)
   goals met: 1 of 24
5. (unstack b8 b3)
   deleted: (clear b8) (handempty) (on b8 b3)
   added: (holding b8) (clear b3)
   goals met: 1 of 24
6. (put-down b8)
   deleted: (holding b8)
   added: (clear b8) (handempty) (ontable b8)
   goals met: 1 of 24
7. (unstack b3 b1)
   deleted: (clear b3) (handempty) (on b3 b1)
   added: (holding b3) (clear b1)
   goals met: 1 of 24
8. (put-down b3)
   deleted: (holding b3)
   added: (clear b3) (handempty) (ontable b3)
   goals met: 1 of 24
9. (unstack b1 b4)
   deleted: (clear b1) (handempty) (on b1 b4)
   added: (holding b1) (clear b4)
   goals met: 1 of 24
10. (put-down b1)
   deleted: (holding b1)
   added: (clear b1) (handempty) (ontable b1)
   goals met: 1 of 24
11. (unstack b4 b11)
   deleted: (clear b4) (handempty) (on b4 b11)
   added: (holding b4) (clear b11)
   goals met: 1 of 24
12. (put-down b4)
   deleted: (holding b4)
   added: (clear b4) (handempty) (ontable b4)
   goals met: 1 of 24
13. (unstack b11 b14)
   deleted: (clear b11) (handempty) (on b11 b14)
   added: (holding b11) (clear b14)
   goals met: 1 of 24
14. (put-down b11)
   deleted: (holding b11)
   added: (clear b11) (handempty) (ontable b11)
   goals met: 1 of 24
15. (unstack b15 b20)
   deleted: (clear b15) (handempty) (on b15 b20)
   added: (holding b15) (clear b20)
   goals met: 1 of 24
16. (put-down b15)
   deleted: (holding b15)
   added: (clear b15) (handempty) (ontable b15)
   goals met: 1 of 24
17. (unstack b20 b2)
   deleted: (clear b20) (handempty) (on b20 b2)
   added: (holding b20) (clear b2)
   goals met: 1 of 24
18. (put-down b20)
   deleted: (holding b20)
   added: (clear b20) (handempty) (ontable b20)
   goals met: 1 of 24
19. (unstack b2 b23)
   deleted: (clear b2) (handempty) (on b2 b23)
   added: (holding b2) (clear b23)
   goals met: 1 of 24
20. (put-down b2)
   deleted: (holding b2)
   added: (clear b2) (handempty) (ontable b2)
   goals met: 1 of 24
21. (unstack b22 b24)
   deleted: (clear b22) (handempty) (on b22 b24)
   added: (holding b22) (clear b24)
   goals met: 1 of 24
22. (put-down b22)
   deleted: (holding b22)
   added: (clear b22) (handempty) (ontable b22)
   goals met: 1 of 24
23. (unstack b24 b19)
   deleted: (clear b24) (handempty) (on b24 b19)
   added: (holding b24) (clear b19)
   goals met: 1 of 24
24. (put-down b24)
   deleted: (holding b24)
   added: (clear b24) (handempty) (ontable b24)
   goals met: 1 of 24
25. (unstack b19 b25)
   deleted: (clear b19) (handempty) (on b19 b25)
   added: (holding b19) (clear b25)
   goals met: 1 of 24
26. (put-down b19)
   deleted: (holding b19)
   added: (clear b19) (handempty) (ontable b19)
   goals met: 1 of 24
27. (unstack b25 b9)
   deleted: (clear b25) (handempty) (on b25 b9)
   added: (holding b25) (clear b9)
   goals met: 1 of 24
28. (put-down b25)
   deleted: (holding b25)
   added: (clear b25) (handempty) (ontable b25)
   goals met: 1 of 24
29. (unstack b9 b5)
   deleted: (clear b9) (handempty) (on b9 b5)
   added: (holding b9) (clear b5)
   goals met: 1 of 24
30. (put-down b9)
   deleted: (holding b9)
   added: (clear b9) (handempty) (ontable b9)
   goals met: 1 of 24
31. (unstack b5 b16)
   deleted: (clear b5) (handempty) (on b5 b16)
   added: (holding b5) (clear b16)
   goals met: 1 of 24
32. (put-down b5)
   deleted: (holding b5)
   added: (clear b5) (handempty) (ontable b5)
   goals met: 1 of 24
33. (unstack b16 b7)
   deleted: (clear b16) (handempty) (on b16 b7)
   added: (holding b16) (clear b7)
   goals met: 1 of 24
34. (put-down b16)
   deleted: (holding b16)
   added: (clear b16) (handempty) (ontable b16)
   goals met: 1 of 24
35. (unstack b7 b12)
   deleted: (clear b7) (handempty) (on b7 b12)
   added: (holding b7) (clear b12)
   goals met: 1 of 24
36. (put-down b7)
   deleted: (holding b7)
   added: (clear b7) (handempty) (ontable b7)
   goals met: 1 of 24
37. (unstack b12 b18)
   deleted: (clear b12) (handempty) (on b12 b18)
   added: (holding b12) (clear b18)
   goals met: 0 of 24
38. (put-down b12)
   deleted: (holding b12)
   added: (clear b12) (handempty) (ontable b12)
   goals met: 0 of 24
39. (unstack b18 b10)
   deleted: (clear b18) (handempty) (on b18 b10)
   added: (holding b18) (clear b10)
   goals met: 0 of 24
40. (put-down b18)
   deleted: (holding b18)
   added: (clear b18) (handempty) (ontable b18)
   goals met: 0 of 24
41. (unstack b10 b17)
   deleted: (clear b10) (handempty) (on b10 b17)
   added: (holding b10) (clear b17)
   goals met: 0 of 24
42. (put-down b10)
   deleted: (holding b10)
   added: (clear b10) (handempty) (ontable b10)
   goals met: 0 of 24
43. (pick-up b15)
   deleted: (ontable b15) (clear b15) (handempty)
   added: (holding b15)
   goals met: 0 of 24
44. (stack b15 b21)
   deleted: (holding b15) (clear b21)
   added: (clear b15) (handempty) (on b15 b21)
   goals met: 1 of 24
45. (pick-up b23)
   deleted: (ontable b23) (clear b23) (handempty)
   added: (holding b23)
   goals met: 1 of 24
46. (stack b23 b15)
   deleted: (holding b23) (clear b15)
   added: (clear b23) (handempty) (on b23 b15)
   goals met: 2 of 24
47. (pick-up b13)
   deleted: (ontable b13) (clear b13) (handempty)
   added: (holding b13)
   goals met: 2 of 24
48. (stack b13 b23)
   deleted: (holding b13) (clear b23)
   added: (clear b13) (handempty) (on b13 b23)
   goals met: 3 of 24
49. (pick-up b17)
   deleted: (ontable b17) (clear b17) (handempty)
   added: (holding b17)
   goals met: 3 of 24
50. (stack b17 b13)
   deleted: (holding b17) (clear b13)
   added: (clear b17) (handempty) (on b17 b13)
   goals met: 4 of 24
51. (pick-up b20)
   deleted: (ontable b20) (clear b20) (handempty)
   added: (holding b20)
   goals met: 4 of 24
52. (stack b20 b17)
   deleted: (holding b20) (clear b17)
   added: (clear b20) (handempty) (on b20 b17)
   goals met: 5 of 24
53. (pick-up b4)
   deleted: (ontable b4) (clear b4) (handempty)
   added: (holding b4)
   goals met: 5 of 24
54. (stack b4 b20)
   deleted: (holding b4) (clear b20)
   added: (clear b4) (handempty) (on b4 b20)
   goals met: 6 of 24
55. (pick-up b5)
   deleted: (ontable b5) (clear b5) (handempty)
   added: (holding b5)
   goals met: 6 of 24
56. (stack b5 b4)
   deleted: (holding b5) (clear b4)
   added: (clear b5) (handempty) (on b5 b4)
   goals met: 7 of 24
57. (pick-up b18)
   deleted: (ontable b18) (clear b18) (handempty)
   added: (holding b18)
   goals met: 7 of 24
58. (stack b18 b5)
   deleted: (holding b18) (clear b5)
   added: (clear b18) (handempty) (on b18 b5)
   goals met: 8 of 24
59. (pick-up b12)
   deleted: (ontable b12) (clear b12) (handempty)
   added: (holding b12)
   goals met: 8 of 24
60. (stack b12 b18)
   deleted: (holding b12) (clear b18)
   added: (clear b12) (handempty) (on b12 b18)
   goals met: 9 of 24
61. (pick-up b11)
   deleted: (ontable b11) (clear b11) (handempty)
   added: (holding b11)
   goals met: 9 of 24
62. (stack b11 b12)
   deleted: (holding b11) (clear b12)
   added: (clear b11) (handempty) (on b11 b12)
   goals met: 10 of 24
63. (pick-up b10)
   deleted: (ontable b10) (clear b10) (handempty)
   added: (holding b10)
   goals met: 10 of 24
64. (stack b10 b11)
   deleted: (holding b10) (clear b11)
   added: (clear b10) (handempty) (on b10 b11)
   goals met: 11 of 24
65. (pick-up b7)
   deleted: (ontable b7) (clear b7) (handempty)
   added: (holding b7)
   goals met: 11 of 24
66. (stack b7 b10)
   deleted: (holding b7) (clear b10)
   added: (clear b7) (handempty) (on b7 b10)
   goals met: 12 of 24
67. (pick-up b3)
   deleted: (ontable b3) (clear b3) (handempty)
   added: (holding b3)
   goals met: 12 of 24
68. (stack b3 b7)
   deleted: (holding b3) (clear b7)
   added: (clear b3) (handempty) (on b3 b7)
   goals met: 13 of 24
69. (pick-up b19)
   deleted: (ontable b19) (clear b19) (handempty)
   added: (holding b19)
   goals met: 13 of 24
70. (stack b19 b3)
   deleted: (holding b19) (clear b3)
   added: (clear b19) (handempty) (on b19 b3)
   goals met: 14 of 24
71. (pick-up b2)
   deleted: (ontable b2) (clear b2) (handempty)
   added: (holding b2)
   goals met: 14 of 24
72. (stack b2 b19)
   deleted: (holding b2) (clear b19)
   added: (clear b2) (handempty) (on b2 b19)
   goals met: 15 of 24
73. (pick-up b16)
   deleted: (ontable b16) (clear b16) (handempty)
   added: (holding b16)
   goals met: 15 of 24
74. (stack b16 b2)
   deleted: (holding b16) (clear b2)
   added: (clear b16) (handempty) (on b16 b2)
   goals met: 16 of 24
75. (pick-up b8)
   deleted: (ontable b8) (clear b8) (handempty)
   added: (holding b8)
   goals met: 16 of 24
76. (stack b8 b16)
   deleted: (holding b8) (clear b16)
   added: (clear b8) (handempty) (on b8 b16)
   goals met: 17 of 24
77. (pick-up b25)
   deleted: (ontable b25) (clear b25) (handempty)
   added: (holding b25)
   goals met: 17 of 24
78. (stack b25 b8)
   deleted: (holding b25) (clear b8)
   added: (clear b25) (handempty) (on b25 b8)
   goals met: 18 of 24
79. (pick-up b6)
   deleted: (ontable b6) (clear b6) (handempty)
   added: (holding b6)
   goals met: 18 of 24
80. (stack b6 b25)
   deleted: (holding b6) (clear b25)
   added: (clear b6) (handempty) (on b6 b25)
   goals met: 19 of 24
81. (pick-up b14)
   deleted: (ontable b14) (clear b14) (handempty)
   added: (holding b14)
   goals met: 19 of 24
82. (stack b14 b6)
   deleted: (holding b14) (clear b6)
   added: (clear b14) (handempty) (on b14 b6)
   goals met: 20 of 24
83. (pick-up b1)
   deleted: (ontable b1) (clear b1) (handempty)
   added: (holding b1)
   goals met: 20 of 24
84. (stack b1 b14)
   deleted: (holding b1) (clear b14)
   added: (clear b1) (handempty) (on b1 b14)
   goals met: 21 of 24
85. (pick-up b24)
   deleted: (ontable b24) (clear b24) (handempty)
   added: (holding b24)
   goals met: 21 of 24
86. (stack b24 b1)
   deleted: (holding b24) (clear b1)
   added: (clear b24) (handempty) (on b24 b1)
   goals met: 22 of 24
87. (pick-up b9)
   deleted: (ontable b9) (clear b9) (handempty)
   added: (holding b9)
   goals met: 22 of 24
88. (stack b9 b24)
   deleted: (holding b9) (clear b24)
   added: (clear b9) (handempty) (on b9 b24)
   goals met: 23 of 24
89. (pick-up b22)
   deleted: (ontable b22) (clear b22) (handempty)
   added: (holding b22)
   goals met: 23 of 24
90. (stack b22 b9)
   deleted: (holding b22) (clear b9)
   added: (clear b22) (handempty) (on b22 b9)
   goals met: 24 of 24
